# Taps
tap 'caskroom/cask'
tap 'd12frosted/emacs-plus'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'

# Binaries
brew 'antigen'			# ZSH package manager
brew 'bash' 			# Latest Bash
brew 'bash-completion'
brew 'coreutils'		# GNU core utilities (more updated than the macOS ones)
brew 'findutils'		# GNU `find`, `updatedb`, and `xargs`
brew 'git'			# Most updated git
brew 'hub'			# GitHub helper
brew 'mackup'			# Mac app settings backup/restore
brew 'mas'			# Mac App Store CLI
brew 'python'
brew 'python3'
brew 'ruby'
brew 'terminal-notifier'	# Mac notifications for failing/long running tasks
brew 'thefuck'			# Fixes common CLI mistakes
brew 'tmux'
brew 'trash'			# Send files to trash from CLI
brew 'transmission'		# Torrent client
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'd12frosted/emacs-plus/emacs-plus'	# My favorite Emacs for Mac

# Apps
cask 'dropbox'
cask 'slack'
cask 'transmission'		# Torrent client
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
